// 기본 용어

/*
표현식 : 값을 만들어내는 간단한 코드 / 하나 이상의 표현식 -> 문장 : 세미콜론 or 줄바꿈으로 구별

키워드 : JS 처음 만들어질 때 정해둔 특별한 의미가 있는 단어, 계속 증가 ex)const, return, ...

식별자 : 프로그래밍 언어에서 이름 붙일 때 사용, 주로 변수명이나 함수명 등으로 사용
- 식별자 생성 규칙 : 키워드 사용 X, 숫자로 시작 X, 특수문자는 _와 $만 허용, 공백문자 포함 X
- 식별자 생성 관례 : 클래스 이름 대문자로 시작, {변수, 인스턴스, 함수, 메소드}이름은 소문자로 시작, 여러 단어로 이뤄진 식별자는 각 단어의 첫글자 대문자로
- 식별자 종류 : 크게 4종류 / 변수(식별자 뒤 괄호 x, 단독사용), 속성(괄호x, 다른식별자와 사용), 함수(괄호o, 단독사용), 메소드(괄호o, 다른 메소드와 사용)

주석 : HTML = <!-- 주석 --> / JS = // 한줄주석,  /* 여러줄 주석 * /(공백없이)

*/
